In [28]:
import pandas as pd
import numpy as np
import copy

In [2]:
tabela = pd.DataFrame({'nome': ['rafael', 'joao','rafael', 'maria'],'nota': [10,9,8,7], })

In [3]:
tabela

     nome  nota
0  rafael    10
1    joao     9
2  rafael     8
3   maria     7

In [4]:
tabela.nome

0    rafael
1      joao
2    rafael
3     maria
Name: nome, dtype: object

In [5]:
tabela.nome[2]

'rafael'

In [6]:
tabela.loc[2, 'nome']

'rafael'

In [7]:
tabela.groupby('nome').mean()

        nota
nome
joao     9.0
maria    7.0
rafael   9.0

In [8]:
tabela.groupby('nome').count()

        nota
nome
joao       1
maria      1
rafael     2

In [9]:
tabela.nota

0    10
1     9
2     8
3     7
Name: nota, dtype: int64

In [10]:
tabela.nota[tabela.nome=='rafael']

0    10
2     8
Name: nota, dtype: int64

In [24]:
tabela2 =np.array(tabela)

In [25]:
tabela2

array([['rafael', 3],
       ['joao', 9],
       ['rafael', 8],
       ['maria', 7]], dtype=object)

In [26]:
tabela3=tabela

In [27]:
tabela3.loc[0,'nota']=3